IDEA Open Model
OpenAttribute Class
Compatible with IDEA StatiCa Beta 20.0
 Open attribute base class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenAttribute
 IdeaRS.OpenModel.Concrete.ConcreteMemberData
 IdeaRS.OpenModel.CrossSection.CrossSectionCreepCoefficientAttribute
 IdeaRS.OpenModel.CrossSection.CrossSectionThermalAttribute
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public abstract class OpenAttribute : OpenObject
Public MustInherit Class OpenAttribute
	Inherits OpenObject
The OpenAttribute type exposes the following members.
Constructors
Name | Description
OpenAttribute
Initializes a new instance of the OpenAttribute class
Top
Properties
Name | Description
Element
 Element for attribute
Top
See Also
Reference
IdeaRS.OpenModel Namespace